TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0g511x.h
/* IOMUX_PINCM51[PF] Bits */
#define IOMUX_PINCM51_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM51_PF_GPIOB_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM51_PF_UC1_CTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM51_PF_UC3_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM51_PF_UC3_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM51_PF_TIMA_FAULT0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM51_PF_COMP0_OUT                    ((uint32_t)0X00000005)

/* IOMUX_PINCM52[PF] Bits */
#define IOMUX_PINCM52_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM52_PF_GPIOB_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM52_PF_UC2_CS3                      ((uint32_t)0X00000002)
#define IOMUX_PINCM52_PF_UC2_CS1                      ((uint32_t)0X00000003)
#define IOMUX_PINCM52_PF_UC3_POCI                     ((uint32_t)0X00000004)
#define IOMUX_PINCM52_PF_UC3_RTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM52_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM52_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000006)

/* IOMUX_PINCM53[PF] Bits */
#define IOMUX_PINCM53_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM53_PF_GPIOA_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM53_PF_UC3_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM53_PF_UC3_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM53_PF_UC2_CS3                      ((uint32_t)0X00000003)
#define IOMUX_PINCM53_PF_UC3_CS0                      ((uint32_t)0X00000004)
#define IOMUX_PINCM53_PF_UC3_CTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM53_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM53_PF_TIMG0_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM53_PF_TIMG7_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM53_PF_I2S0_WCLK                    ((uint32_t)0X00000008)

/* IOMUX_PINCM54[PF] Bits */
#define IOMUX_PINCM54_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM54_PF_GPIOA_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM54_PF_UC3_POCI                     ((uint32_t)0X00000002)
#define IOMUX_PINCM54_PF_UC3_RTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM54_PF_UC2_CS2                      ((uint32_t)0X00000003)
#define IOMUX_PINCM54_PF_UC3_SCLK                     ((uint32_t)0X00000004)
#define IOMUX_PINCM54_PF_UC3_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM54_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM54_PF_TIMG0_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM54_PF_TIMG7_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM54_PF_I2S0_AD1                     ((uint32_t)0X00000008)

/* IOMUX_PINCM55[PF] Bits */
#define IOMUX_PINCM55_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM55_PF_GPIOA_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM55_PF_UC3_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM55_PF_UC3_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM55_PF_UC2_CS3                      ((uint32_t)0X00000003)
#define IOMUX_PINCM55_PF_UC3_PICO                     ((uint32_t)0X00000004)
#define IOMUX_PINCM55_PF_UC3_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM55_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM55_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000006)
#define IOMUX_PINCM55_PF_COMP0_OUT                    ((uint32_t)0X00000007)

/* IOMUX_PINCM56[PF] Bits */
#define IOMUX_PINCM56_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM56_PF_GPIOB_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM56_PF_UC0_CTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM56_PF_UC2_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM56_PF_TIMA_FAULT0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM56_PF_TIMA_FAULT1                  ((uint32_t)0X00000005)
#define IOMUX_PINCM56_PF_TIMA_FAULT2                  ((uint32_t)0X00000006)
#define IOMUX_PINCM56_PF_COMP0_OUT                    ((uint32_t)0X00000007)
#define IOMUX_PINCM56_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000008)

/* IOMUX_PINCM57[PF] Bits */
#define IOMUX_PINCM57_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM57_PF_GPIOB_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM57_PF_UC0_RTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM57_PF_UC2_CS1                      ((uint32_t)0X00000003)
#define IOMUX_PINCM57_PF_TIMA0_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM57_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM57_PF_TIMG6_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM57_PF_COMP0_OUT                    ((uint32_t)0X00000007)
#define IOMUX_PINCM57_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000008)

/* IOMUX_PINCM58[PF] Bits */
#define IOMUX_PINCM58_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM58_PF_GPIOA_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM58_PF_UC0_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM58_PF_UC0_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM58_PF_UC1_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM58_PF_UC1_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM58_PF_TIMG7_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM58_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000006)
#define IOMUX_PINCM58_PF_TIMA_FAULT0                  ((uint32_t)0X00000007)
#define IOMUX_PINCM58_PF_UC3_PICO                     ((uint32_t)0X00000008)
#define IOMUX_PINCM58_PF_UC3_TX                       ((uint32_t)0X00000008)

/* IOMUX_PINCM59[PF] Bits */
#define IOMUX_PINCM59_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM59_PF_GPIOA_DIO27                  ((uint32_t)0X00000001)
#define IOMUX_PINCM59_PF_UC0_SCL                      ((uint32_t)0X00000003)
#define IOMUX_PINCM59_PF_UC0_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM59_PF_UC1_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM59_PF_UC1_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM59_PF_TIMG7_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM59_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM59_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000007)
#define IOMUX_PINCM59_PF_COMP0_OUT                    ((uint32_t)0X00000008)
#define IOMUX_PINCM59_PF_UC3_SCLK                     ((uint32_t)0X00000009)
#define IOMUX_PINCM59_PF_UC3_RX                       ((uint32_t)0X00000009)
#define IOMUX_PINCM59_PF_TIMA_FAULT2                  ((uint32_t)0X0000000A)


#if   defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050))
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/*@}*/ /* end of group MSPM0G511X_PeripheralDecl */

/*@}*/ /* end of group MSPM0G511X_Definitions */

#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_m0p_mspm0g511x__include */
